jmeter-tests/elements.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Magento 2 Advanced Load Test" enabled="true">
            <stringProp name="TestPlan.comments">Advanced load testing for Magento 2 with KeyDB integration</stringProp>
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                    <elementProp name="baseURL" elementType="Argument">
                        <stringProp name="Argument.name">baseURL</stringProp>
                        <stringProp name="Argument.value">elements.vendic.nl</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>

                    <elementProp name="Port" elementType="Argument">
                        <stringProp name="Argument.name">Port</stringProp>
                        <stringProp name="Argument.value">443</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>

                    <elementProp name="Protocol" elementType="Argument">
                        <stringProp name="Argument.name">Protocol</stringProp>
                        <stringProp name="Argument.value">https</stringProp>
                        <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                </collectionProp>
            </elementProp>
        </TestPlan>
        <hashTree>
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Magento User Behaviors" enabled="true">
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Iterations" enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">10</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">50</stringProp>
                <stringProp name="ThreadGroup.ramp_time">100</stringProp>
                <boolProp name="ThreadGroup.scheduler">true</boolProp>
                <stringProp name="ThreadGroup.duration">3600</stringProp>
            </ThreadGroup>
            <hashTree>
                <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true"/>
                <hashTree/>
                <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <stringProp name="HTTPSampler.domain">${baseURL}</stringProp>
                    <stringProp name="HTTPSampler.port">${Port}</stringProp>
                    <stringProp name="HTTPSampler.protocol">${Protocol}</stringProp>
                    <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
                    <stringProp name="HTTPSampler.path">/test</stringProp>
                </ConfigTestElement>
                <hashTree/>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
                    <collectionProp name="HeaderManager.headers">
                        <elementProp name="" elementType="Header">
                            <stringProp name="Header.name">User-Agent</stringProp>
                            <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36</stringProp>
                        </elementProp>
                        <elementProp name="" elementType="Header">
                            <stringProp name="Header.name">Accept-Encoding</stringProp>
                            <stringProp name="Header.value">gzip, deflate</stringProp>
                        </elementProp>
                    </collectionProp>
                </HeaderManager>
                <hashTree/>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Load Home Page" enabled="true">
                    <stringProp name="HTTPSampler.path">/</stringProp>
                </HTTPSamplerProxy>
                <hashTree/>
            </hashTree>
            <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
                <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
        </hashTree>
    </hashTree>
</jmeterTestPlan>